# -*- coding: utf-8 -*-

#Αν λαμβάνετε σφάλματα σχετικά με ASCII κωδικοποιήσεις, τότε βάλτε αυτό # -*- coding: utf-8 -*- στην αρχή του scripts σας.Έτσι θα μπορέσετε να χρησιμοποιήσετε Unicode UTF-8 και ελληνικούς χαρακτήρες στα script σας χωρίς πρόβλημα.

#Σύμβολο (hash #) Η γραμμή που ξεκινάει με το # είναι ένα σχόλιο και αγνοείται από το διερμηνέα (interpreter).

#Σημείωση: Οι συμβολοσειρές (strings) είναι αμετάβλητες, Αυτό σημαίνει ότι αφότου δημιουργήσετε μια συμβολοσειρά, δεν μπορείτε να την αλλάξετε.
print "Συμβολοσειρά είναι μια ακολουθία από χαρακτήρες, λέξεις"

#Οι συμβολοσειρές (strings) μπορούν να περικλείονται σε μονά '.', διπλά ή και τριπλά εισαγωγικά.
print 'Συμβολοσειρά μεσα σε μονά εισαγωγικά'

print "Συμβολοσειρά μεσα σε διπλά εισαγωγικά"

print '''Συμβολοσειρά μεσα σε τριπλά εισαγωγικά,
οι συμβολοσειρές σε τριπλά εισαγωγικά καταλαμβάνουν πολλές γραμμές.
Αυτές οι συμβολοσειρές μπορούν να περιέχουν 'μονά εισαγωγικά' ή και
"διπλα εισαγωγικά", τις χρησιμοποιούμε συνήθως και για σχολιασμό
του κωδικά μας αντι του συμβόλου #. Στα αγγλικά ονομάζεται multiline string'''

#Μία συμβολοσειρά μπορεί να συνεχιστεί και στην επόμενη γραμμή με το σύμβολο backslash \.
print "Αυτή η συμβολοσειρά μπορει να συνεχιστεί στην\
επόμενη σειρά, χωρίς να προστίθεται καινούρια γραμμή στο αποτέλεσμα."